{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.11.0", "signature": {"inputs": {"lstm_8_input": {"name": "lstm_8_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "6"}]}}}, "outputs": {"dense_4": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "lstm_8_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "6"}]}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_103", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_104", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_105", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_97", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_43", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_44", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_45", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_95", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/Shape", "op": "Shape", "input": ["lstm_8_input"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/transpose", "op": "Transpose", "input": ["lstm_8_input", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_98", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_114", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_103", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/next_iteration/_150"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_115", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_104", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/next_iteration/_151"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_116", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_105", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/next_iteration/_152"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_108", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_97", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/next_iteration/_144"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_54", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_43", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_90"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_55", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_44", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_91"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_56", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_45", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_92"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_84"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_82"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_106", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_95", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/next_iteration/_142"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/Shape", "StatefulPartitionedCall/sequential_4/lstm_8/strided_slice/stack", "StatefulPartitionedCall/sequential_4/lstm_8/strided_slice/stack_1", "StatefulPartitionedCall/sequential_4/lstm_8/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_109", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_98", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/next_iteration/_145"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/strided_slice", "StatefulPartitionedCall/sequential_4/lstm_8/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/strided_slice", "StatefulPartitionedCall/sequential_4/lstm_8/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_42", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/zeros_1/packed", "StatefulPartitionedCall/sequential_4/lstm_8/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/zeros/packed", "StatefulPartitionedCall/sequential_4/lstm_8/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_53", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_42", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_89"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_41", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_40", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/zeros_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_39", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/zeros"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_38", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_52", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_41", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_88"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_51", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_40", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_87"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_39", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_86"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_49", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/enter/_38", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_85"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/cond/_33/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_52", "^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_46"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/cond/_33/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_13_switch/_63", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_51", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_65", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_53", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_14_switch/_66", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_54", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_12_switch/_62", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_15_switch/_67", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_55", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_16_switch/_68", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_56", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/time_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_counter_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2_1_switch/_61", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_49", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice_switch/_64", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/merge/_52", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_counter_switch/_58:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/exit/_73", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2_1_switch/_61"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_89", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_65:1", "^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_90", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_14_switch/_66:1", "^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_91", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_15_switch/_67:1", "^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_12_switch/_62:1", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_15_switch/_67:1", "^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_92", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_16_switch/_68:1", "^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/input/_169", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/time_switch/_60:1", "^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_88", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/strided_slice_switch/_64:1", "^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/exit/_73", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_65:1", "Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/input/_169", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/input/_169", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_counter_switch/_58:1", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/TensorArrayV2Stack/TensorListStack"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_14_switch/_66:1", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/MatMul_1"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/add_2", "^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/add_3", "^StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_102", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/transpose_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/add", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_16_switch/_68:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_113", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_102", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/next_iteration/_149"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/Shape", "StatefulPartitionedCall/sequential_4/lstm_9/strided_slice/stack", "StatefulPartitionedCall/sequential_4/lstm_9/strided_slice/stack_1", "StatefulPartitionedCall/sequential_4/lstm_9/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_101", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/strided_slice"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/split/split_dim", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/strided_slice", "StatefulPartitionedCall/sequential_4/lstm_9/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/strided_slice", "StatefulPartitionedCall/sequential_4/lstm_9/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_112", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_101", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/next_iteration/_148"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/zeros_1/packed", "StatefulPartitionedCall/sequential_4/lstm_9/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/zeros/packed", "StatefulPartitionedCall/sequential_4/lstm_9/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/cond/_93/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_108", "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_112", "^StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/merge/_106"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/Sigmoid_1", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/input/_13_switch/_63:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/Sigmoid", "StatefulPartitionedCall/sequential_4/lstm_8/PartitionedCall/while/body/_34/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_100", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/zeros_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/enter/_99", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF80L2xzdG1fOS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/LoopCond/_117", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_4/lstm_9/PartitionedCall/while/cond/_93/while/Less"]}, {"name": 